{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.8.1", "signature": {"inputs": {"rescaling_10_input:0": {"name": "rescaling_10_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}, {"size": "51"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_10/rescaling_10/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/rescaling_10/Cast_1/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_29/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_29/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "51"}, {"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_30/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_30/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "51"}, {"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_31/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_31/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "40"}, {"size": "30"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_32/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_32/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "30"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_33/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_33/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "20"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/max_pooling1d_5/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_10/flatten_9/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "30"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rescaling_10_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}, {"size": "51"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/rescaling_10/mul", "op": "Mul", "input": ["rescaling_10_input", "StatefulPartitionedCall/sequential_10/rescaling_10/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/rescaling_10/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_10/rescaling_10/mul", "StatefulPartitionedCall/sequential_10/rescaling_10/Cast_1/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_29/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_10/rescaling_10/add", "StatefulPartitionedCall/sequential_10/conv1d_29/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_29/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_10/conv1d_29/conv1d/ExpandDims", "StatefulPartitionedCall/sequential_10/conv1d_29/conv1d/ExpandDims_1", "unknown_0"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_29/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_10/conv1d_29/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_29/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_10/conv1d_29/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_30/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_10/conv1d_29/Relu", "StatefulPartitionedCall/sequential_10/conv1d_30/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_30/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_10/conv1d_30/conv1d/ExpandDims", "StatefulPartitionedCall/sequential_10/conv1d_30/conv1d/ExpandDims_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_30/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_10/conv1d_30/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_30/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_10/conv1d_30/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_31/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_10/conv1d_30/Relu", "StatefulPartitionedCall/sequential_10/conv1d_31/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_31/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_10/conv1d_31/conv1d/ExpandDims", "StatefulPartitionedCall/sequential_10/conv1d_31/conv1d/ExpandDims_1", "unknown_4"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_31/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_10/conv1d_31/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_31/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_10/conv1d_31/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_32/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_10/conv1d_31/Relu", "StatefulPartitionedCall/sequential_10/conv1d_32/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_32/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_10/conv1d_32/conv1d/ExpandDims", "StatefulPartitionedCall/sequential_10/conv1d_32/conv1d/ExpandDims_1", "unknown_6"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_32/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_10/conv1d_32/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_32/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_10/conv1d_32/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_33/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_10/conv1d_32/Relu", "StatefulPartitionedCall/sequential_10/conv1d_33/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_33/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_10/conv1d_33/conv1d/ExpandDims", "StatefulPartitionedCall/sequential_10/conv1d_33/conv1d/ExpandDims_1", "unknown_8"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_33/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_10/conv1d_33/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_33/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_10/conv1d_33/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/max_pooling1d_5/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_10/conv1d_33/Relu", "StatefulPartitionedCall/sequential_10/max_pooling1d_5/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/max_pooling1d_5/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_10/max_pooling1d_5/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "2", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_10/max_pooling1d_5/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/sequential_10/max_pooling1d_5/MaxPool"], "attr": {"squeeze_dims": {"list": {"i": ["2"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/flatten_9/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_10/max_pooling1d_5/Squeeze", "StatefulPartitionedCall/sequential_10/flatten_9/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_30/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_10/flatten_9/Reshape", "unknown_9", "unknown_10"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_31/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_10/dense_30/Relu", "unknown_11", "unknown_12"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_32/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_10/dense_31/Relu", "unknown_13", "unknown_14"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_32/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_10/dense_32/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_10/dense_32/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["前端脚本库%2820190304%29/score/tfjs/group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_10/rescaling_10/Cast", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/rescaling_10/Cast_1/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_29/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_29/conv1d/ExpandDims_1", "shape": [1, 3, 51, 51], "dtype": "float32"}, {"name": "unknown_0", "shape": [51], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_30/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_30/conv1d/ExpandDims_1", "shape": [1, 3, 51, 40], "dtype": "float32"}, {"name": "unknown_2", "shape": [40], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_31/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_31/conv1d/ExpandDims_1", "shape": [1, 3, 40, 30], "dtype": "float32"}, {"name": "unknown_4", "shape": [30], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_32/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_32/conv1d/ExpandDims_1", "shape": [1, 3, 30, 20], "dtype": "float32"}, {"name": "unknown_6", "shape": [20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_33/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_10/conv1d_33/conv1d/ExpandDims_1", "shape": [1, 3, 20, 10], "dtype": "float32"}, {"name": "unknown_8", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10/max_pooling1d_5/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_10/flatten_9/Const", "shape": [2], "dtype": "int32"}, {"name": "unknown_9", "shape": [10, 30], "dtype": "float32"}, {"name": "unknown_10", "shape": [30], "dtype": "float32"}, {"name": "unknown_11", "shape": [30, 25], "dtype": "float32"}, {"name": "unknown_12", "shape": [25], "dtype": "float32"}, {"name": "unknown_13", "shape": [25, 6], "dtype": "float32"}, {"name": "unknown_14", "shape": [6], "dtype": "float32"}]}]}